==================
Ruby code Regular
==================

- test = Test
= test.to_label

---

(document
  (running_ruby
    (ruby_code))
  (ruby_insert
    (ruby_code)))

==================
Ruby code block
==================

= tests.each do
  %h1
  - foo = Bar.new

- tests.each do
  %h1
  - foo = Bar.new

---

(document
  (ruby_insert
    (ruby_code)
    (tag
      (tag_name))
    (running_ruby
      (ruby_code)))
  (running_ruby
    (ruby_code)
    (tag
      (tag_name))
    (running_ruby
      (ruby_code))))

==================
Ruby method call
==================

= awesome_method partial: 'test_results', locals: { f:, test_schedule: test_schedule }
= awesome_method(partial: 'test_results', locals: { f:, test_schedule: test_schedule })
- awesome_method partial: 'test_results', locals: { f:, test_schedule: test_schedule }
- awesome_method(partial: 'test_results', locals: { f:, test_schedule: test_schedule })

---

(document
  (ruby_insert
    (ruby_code))
  (ruby_insert
    (ruby_code))
  (running_ruby
    (ruby_code))
  (running_ruby
    (ruby_code)))

==================
Ruby call spreads multiple lines
==================

= awesome_method partial: 'test_results',
                 locals: { f:,
                           test_schedule: test_schedule }
= awesome_method(partial: 'test_results',
                 locals: { f:,
                           test_schedule: test_schedule })
- awesome_method partial: 'test_results',
                 locals: { f:,
                           test_schedule: test_schedule }
- awesome_method(partial: 'test_results',
                 locals: { f:,
                           test_schedule: test_schedule })

---

(document
  (ruby_insert
    (ruby_code))
  (ruby_insert
    (ruby_code))
  (running_ruby
    (ruby_code))
  (running_ruby
    (ruby_code)))

==================
Ruby hash spreads multiple lines
==================

%div{
  test: 12,
  test_2: 21
}

%div{ test: 12,
      test_2: 21 }

---

(document
  (tag
    (tag_name)
    (hash_attributes))
  (tag
    (tag_name)
    (hash_attributes)))

==================
Ruby nested hash
==================

%div{
  data: { test: 12 },
  test_2: 21
}

---

(document
  (tag
    (tag_name)
    (hash_attributes)))
